print("Задача №1: Написать генератор для отношения\nR = {(x,y): x < y-1} на множествах:\nA = {9,7,5,3,1} и B = {0,2,4,8}")
A, B = {9,7,5,3,1}, {0,2,4,8}
R = {(x,y) for x in A for y in B if x < y-1}
print("Ответ:", R, "\n--------")

print("Задача №2: Написать генератор для отношения\nR = {(x,y): x**2 = y} на множествах:\nA = {-3,2,1,-1} и B = {1,9,6}")
A, B = {-3,2,1,-1}, {1,9,6}
R = {(x,y) for x in A for y in B if x**2 == y}
print("Ответ:", R, "\n--------")

print("Задача №3: Написать генератор для характеристического вектора\nмножества A = {7,1,6} относительно множества B = {7,6,8,2,4,1,9,3,5},\nупорядоченного по возрастанию.  Аналогично для А2 = {3,1,9}")
A = {7,1,6} 
A2 = {3,1,9}
B = {7,6,8,2,4,1,9,3,5}

R1 = [(x,y) for x in A for y in B]
R2 = [(x,y) for x in A2 for y in B]
print("Ответ для А и B:", R1, '\v')
print("Ответ для А2 и B:", R2, "\n--------")
