print("Задача №1: Написать генератор для отношения\nR = {(x,y): x < y-1} на множествах:\nA = {9,7,5,3,1} и B = {0,2,4,8}")
A, B = {9,7,5,3,1}, {0,2,4,8}
R = {(x,y) for x in A for y in B if x < y-1}
print("Ответ:", R, "\n--------")
# {(3, 8), (1, 8), (1, 4), (5, 8)}

def sort_set(in_set):
	x = list(in_set)
	x.sort()
	return x

z = [[True if x < y-1 else False for y in sort_set(B)] for x in sort_set(A)]
print(z)



print("Задача №2: Написать генератор для отношения\nR = {(x,y): x**2 = y} на множествах:\nA = {-3,2,1,-1} и B = {1,9,6}")
A, B = {-3,2,1,-1}, {1,9,6}
R = {(x,y) for x in A for y in B if x**2 == y}
print("Ответ:", R, "\n--------")

print("Задача №3: Написать генератор для характеристического вектора\n"+
	  "множества A = {7,1,6} относительно множества B = {7,6,8,2,4,1,9,3,5},"+
	  "\nупорядоченного по возрастанию.  Аналогично для А2 = {3,1,9}")
A = {7,1,6} 
A2 = {3,1,9}
B = {7,6,8,2,4,1,9,3,5}

r = [1 if x in A else 0 for x in list(B)]
r2 = [1 if x in A2 else 0 for x in list(B)]

print(r)
print(r2)



